/**
  PROJECT 	: Sample project
  FILENAME	: header_template.c
  VERSION 	: 1.0
  DATE 		: 2020-05-XX
*/
//=========================================================================//
// MODULES USED
//=========================================================================//
#include "header_template.h"
//=========================================================================//
// LOCAL FUNCTION PROTOTYPE
//=========================================================================//
int ups_plus_impl(int a, int b);
//=========================================================================//
// EXTERN FUNTION
//=========================================================================//
/**
  desc : 더하기 연산 수행
  param a : 더하기 연산 수행을 위한 인자
  param b : 더하기 연산 수행을 위한 인자
  return
  : 더하기 연산 결과 값 반환
*/ 
int ups_plus(int a, int b) {
  return ups_plus_impl(a, b);
}

/////////////////////////////////////////////////////////////////////////////

//=========================================================================//
// LOCAL FUNTION
//=========================================================================//

/**
  desc : 더하기 연산 수행
  param a : 더하기 연산 수행을 위한 인자
  param b : 더하기 연산 수행을 위한 인자
  return
  : 더하기 연산 결과 값 반환
*/ 
int ups_plus_impl(int a, int b) {
  return (a + b);
}